test/fixtures/api.omise.co/search-charge-get.json

{
  "object": "search",
  "order": "chronological",
  "scope": "charge",
  "query": "",
  "filters": {
    "paid": "true",
    "amount": "10000"
  },
  "page": 1,
  "location": "/search",
  "total_pages": 1,
  "total": 1,
  "data": [
    {
      "object": "charge",
      "id": "chrg_test_557ib11djeat7p5k22r",
      "livemode": false,
      "location": "/charges/chrg_test_557ib11djeat7p5k22r",
      "amount": 1000000,
      "currency": "thb",
      "description": null,
      "status": "successful",
      "capture": true,
      "authorized": true,
      "reversed": false,
      "paid": true,
      "transaction": "trxn_test_557ib12sgdx84mm802i",
      "refunded": 0,
      "refunds": {
        "object": "list",
        "from": "1970-01-01T00:00:00+00:00",
        "to": "2016-09-14T14:28:00+00:00",
        "offset": 0,
        "limit": 20,
        "total": 0,
        "order": null,
        "location": "/charges/chrg_test_557ib11djeat7p5k22r/refunds",
        "data": [

        ]
      },
      "failure_code": null,
      "failure_message": null,
      "card": {
        "object": "card",
        "id": "card_test_557ib0w90t885i4lh6o",
        "livemode": false,
        "country": "us",
        "city": null,
        "postal_code": null,
        "financing": "",
        "bank": "",
        "last_digits": "4242",
        "brand": "Visa",
        "expiration_month": 6,
        "expiration_year": 2020,
        "fingerprint": "WJhoQrhdxrPYDBcGBNeZu+R4TcX/D23HitUUud8tELs=",
        "name": "Kubo",
        "security_code_check": true,
        "created": "2016-09-02T16:34:55Z"
      },
      "customer": null,
      "ip": null,
      "dispute": {
        "object": "dispute",
        "id": "dspt_test_55aj9q9iipt3tcdwb5r",
        "livemode": false,
        "location": "/disputes/dspt_test_55aj9q9iipt3tcdwb5r",
        "amount": 1000000,
        "currency": "thb",
        "status": "open",
        "transaction": "trxn_test_55aj9q9nyokxlvall1i",
        "message": null,
        "reason_code": "goods_or_services_not_provided",
        "reason_message": "Services not provided or Merchandise not received",
        "charge": "chrg_test_557ib11djeat7p5k22r",
        "created": "2016-09-10T10:18:21Z"
      },
      "created": "2016-09-02T16:34:55Z"
    }
  ]
}
